FemDesign.Sections.ComplexSection
Complex section.
strusoft.xsd: complex_section_type

FemDesign.Sections.ComplexSection.#ctor
Parameterless constructor for serialization.

FemDesign.Sections.ComplexSection.#ctor(FemDesign.Sections.Section,FemDesign.Bars.Eccentricity)
Create simple complex section from section and eccentricity. Equal cross-section and eccentricity at both ends of bar.
section: Cross-section
eccentricity: Eccentricity

FemDesign.Sections.ComplexSection.#ctor(FemDesign.Sections.Section,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity,FemDesign.Bars.Eccentricity)
Create complex section from a start and end section and eccentricity.

FemDesign.Sections.ComplexSection.#ctor(FemDesign.Sections.Section[],FemDesign.Bars.Eccentricity[])
Create complex section from sections and eccentricity

FemDesign.Sections.ComplexSection.#ctor(System.Collections.Generic.List{FemDesign.Sections.ComplexSectionPart})
Construct a complex section from a list of ModelSections
complexSectionParts: List of model sections